subhra-g/mspm0-sdk/examples/nortos/LP_MSPM0L2228/demos/fatfs_sd_spi/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0L2228
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0L2228
#define CONFIG_MSPM0L2228

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMA0)
#define TIMER_0_INST_IRQHandler                                 TIMA0_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMA0_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                         (31999U)



/* Defines for SD_SPI */
#define SD_SPI_INST                                                        SPI0
#define SD_SPI_INST_IRQHandler                                  SPI0_IRQHandler
#define SD_SPI_INST_INT_IRQN                                      SPI0_INT_IRQn
#define GPIO_SD_SPI_PICO_PORT                                             GPIOA
#define GPIO_SD_SPI_PICO_PIN                                     DL_GPIO_PIN_14
#define GPIO_SD_SPI_IOMUX_PICO                                  (IOMUX_PINCM40)
#define GPIO_SD_SPI_IOMUX_PICO_FUNC                  IOMUX_PINCM40_PF_SPI0_PICO
#define GPIO_SD_SPI_POCI_PORT                                             GPIOA
#define GPIO_SD_SPI_POCI_PIN                                     DL_GPIO_PIN_10
#define GPIO_SD_SPI_IOMUX_POCI                                  (IOMUX_PINCM25)
#define GPIO_SD_SPI_IOMUX_POCI_FUNC                  IOMUX_PINCM25_PF_SPI0_POCI
/* GPIO configuration for SD_SPI */
#define GPIO_SD_SPI_SCLK_PORT                                             GPIOA
#define GPIO_SD_SPI_SCLK_PIN                                     DL_GPIO_PIN_11
#define GPIO_SD_SPI_IOMUX_SCLK                                  (IOMUX_PINCM26)
#define GPIO_SD_SPI_IOMUX_SCLK_FUNC                  IOMUX_PINCM26_PF_SPI0_SCLK



/* Port definition for Pin Group SD_CS_GPIO */
#define SD_CS_GPIO_PORT                                                  (GPIOA)

/* Defines for SD: GPIOA.9 with pinCMx 20 on package pin 23 */
#define SD_CS_GPIO_SD_PIN                                        (DL_GPIO_PIN_9)
#define SD_CS_GPIO_SD_IOMUX                                      (IOMUX_PINCM20)




/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_SD_SPI_init(void);

void SYSCFG_DL_SYSTICK_init(void);


#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
